kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
void HAL_IOCX_Init()
{
	uint8_t i;
	for (i = 0; i < IOCX_NUM_INTERRUPTS; i++) {
		IOCX_gpio_pin_to_interrupt_index_map[i] = INVALID_INTERRUPT_INDEX;
	}
	for (i = 0; i < IOCX_NUM_GPIOS; i++) {
		if (gpio_channels[i].interrupt_type == INT_EXTI) {
			IOCX_gpio_pin_to_interrupt_index_map[POSITION_VAL(gpio_channels[i].pin)] = gpio_channels[i].interrupt_index;
			IOCX_gpio_pin_to_gpio_channel_index_map[POSITION_VAL(gpio_channels[i].pin)] = i;
			IOCX_gpio_pin_mode_configuration[POSITION_VAL(gpio_channels[i].pin)] = 0;
			attachInterrupt(gpio_channels[i].pin, &HAL_IOCX_EXTI_ISR, FALLING);
		} else if (gpio_channels[i].interrupt_type == INT_ALTPIN) {
			IOCX_gpio_pin_to_interrupt_index_map[POSITION_VAL(altint_pin)] = gpio_channels[i].interrupt_index;
			IOCX_gpio_pin_to_gpio_channel_index_map[POSITION_VAL(altint_pin)] = i;
			IOCX_gpio_pin_mode_configuration[POSITION_VAL(altint_pin)] = 0;
			attachInterrupt(altint_pin, &HAL_IOCX_EXTI_ISR, FALLING);
		}
	}
}

void HAL_IOCX_Ext_Power_Enable(int enable)
{
	HAL_GPIO_WritePin(EXT_PWR_SWITCH_ON_GPIO_Port, EXT_PWR_SWITCH_ON_Pin,
			(enable ? GPIO_PIN_SET : GPIO_PIN_RESET));
}

void HAL_IOCX_RPI_GPIO_Driver_Enable(int enable)
{
	  HAL_GPIO_WritePin(_RPI_GPIO_OE1_GPIO_Port, _RPI_GPIO_OE1_Pin,
			  (enable ? GPIO_PIN_RESET : GPIO_PIN_SET));
	  HAL_GPIO_WritePin(_RPI_GPIO_OE2_GPIO_Port, _RPI_GPIO_OE2_Pin,
			  (enable ? GPIO_PIN_RESET : GPIO_PIN_SET));
}

void HAL_IOCX_RPI_COMM_Driver_Enable(int enable)
{
	  HAL_GPIO_WritePin(COMM_OE2_GPIO_Port, COMM_OE2_Pin,
			  (enable ? GPIO_PIN_SET : GPIO_PIN_RESET));
}

/* Returns 0 if pins are input, non-zero if output */
int HAL_IOCX_RPI_GPIO_Output()
{
	if (HAL_GPIO_ReadPin(RPI_GPIO_DIR_IN_GPIO_Port, RPI_GPIO_DIR_IN_Pin) == GPIO_PIN_SET) {
		return 1;
	}
	return 0;
}

/* Returns 0 if no ext power fault has occurred, non-zero indicates fault has occurred. */
int HAL_IOCX_Ext_Power_Fault()
{
	if (HAL_GPIO_ReadPin(_IO_POWER_FAULT_GPIO_Port, _IO_POWER_FAULT_Pin) == GPIO_PIN_RESET) {
		return 1;
	}
	return 0;
}

/* IOCX GPIO Interrupt Generation:
 *
 * Each of the 16 IOCX GPIO Pins (12 Digital + 4 Analog when Triggers are Used)
 * may be optionally configured to generate an interrupt.  This is managed
 * by a simple mechanism consisting of:
 *
 * - Interrupt Mask
 * - Interrupt Status
 * - Interrupt Assertion GPIO Pin (Active Low)
 *
 * Two separate interrupt "edge detection" methods are used:
 *
 * 1) IOCX Hardware Interrupts:
 *
 * An ISR handles STM32 EXTI interrupts on configured GPIO edges.
 *
 * 3) Analog Triggering:
 *
 * The VMX Analog Triggers may be used to detect edges on any of the
 * VMX Analog Inputs, and are implemented external to this file. An
 * interface is provided allowing GPIO Interrupt Assertion/Deassertion
 * in these cases.
 */

void HAL_IOCX_AssertInterruptSignal()
{
	/* Assert Interrupt Pin */
	HAL_GPIO_WritePin(NAVX_2_RPI_INT4_GPIO_Port, NAVX_2_RPI_INT4_Pin,GPIO_PIN_RESET);
}

/* Todo:  For performance, inline and move these to header file. */
void HAL_IOCX_AssertInterrupt(uint16_t int_status_bit)
{
	if (int_status_bit & int_mask) {
		int_status |= int_status_bit;
		HAL_IOCX_AssertInterruptSignal();
	}
}

void HAL_IOCX_DeassertInterruptSignal()
{
	HAL_GPIO_WritePin(NAVX_2_RPI_INT4_GPIO_Port, NAVX_2_RPI_INT4_Pin,GPIO_PIN_SET);
}

void HAL_IOCX_DeassertInterrupt(uint16_t int_bits_to_clear) {
	int_status &= ~int_bits_to_clear;
	if (!(int_status & int_mask)) {
		HAL_IOCX_DeassertInterruptSignal();
	}
}

void HAL_IOCX_UpdateInterruptMask(uint16_t int_bits) {
	int_mask = int_bits;
	/* If all actively assert interrupts are now masked    */
	/* then deassert the interrupt signal, and vice versa. */
	if(!(int_status & int_mask)) {
		HAL_IOCX_DeassertInterruptSignal();
	} else {
		HAL_IOCX_AssertInterruptSignal();
	}
	/* TOdo:  use mask in GPIO EXTI ISRs to avoid unnecessary dispatch */
}

uint16_t HAL_IOCX_GetInterruptMask() {
	return int_mask;
}

uint16_t HAL_IOCX_GetInterruptStatus() {
	return int_status;
}

uint16_t HAL_IOCX_GetLastInterruptEdges() {
	return last_int_edge;
}

/***************************************************************************/
/* Timer section                                                           */
/*                                                                         */
/* Each timer is clocked off of either APB1 or APB2, as follows:           */
/*                                                                         */
/* APB1 Timer Clocks:  48Mhz (TIM1, TIM9, TIM10, TIM11)					   */
/* APB2 Timer Clocks:  96Mhz (TIM2, TIM3, TIM4, TIM5)					   */
/*																		   */
/* To keep things uniform, all 96Mhz clock sources use an internal         */
/* (/2) divider - thus all clocks operate at a clock frequency (fTIM) of   */
/* 48Mhz.                                                                  */
/***************************************************************************/

TIM_HandleTypeDef htim1 = {TIM1};
TIM_HandleTypeDef htim2 = {TIM2};
TIM_HandleTypeDef htim3 = {TIM3};
TIM_HandleTypeDef htim4 = {TIM4};
TIM_HandleTypeDef htim5 = {TIM5};
TIM_HandleTypeDef htim9 = {TIM9};

#define NUM_IOCX_QUAD_ENCODERS 5

int qe_enabled[NUM_IOCX_QUAD_ENCODERS] = { 0, 0, 0, 0, 0 };

int qe_curr_mode[NUM_IOCX_QUAD_ENCODERS] = {
		QUAD_ENCODER_MODE_4x,
		QUAD_ENCODER_MODE_4x,
		QUAD_ENCODER_MODE_4x,
		QUAD_ENCODER_MODE_4x,
		QUAD_ENCODER_MODE_4x,
};
uint16_t qe0_last_count = 0;
uint32_t qe1_last_count = 0;
uint16_t qe2_last_count = 0;
uint16_t qe3_last_count = 0;
uint32_t qe4_last_count = 0;

volatile int32_t qe_total_count[NUM_IOCX_QUAD_ENCODERS] = { 0, 0, 0, 0, 0 };

static int QEIntegratorEnabled(uint8_t qe_index) {
	if (qe_index < NUM_IOCX_QUAD_ENCODERS) {
		return qe_enabled[qe_index];
	} else {
		return 0;
	}
}

static void ResetQEIntegrator(uint8_t qe_index, int enabled) {
	if (qe_index < NUM_IOCX_QUAD_ENCODERS) {
        NVIC_DisableIRQ(SysTick_IRQn);
		qe_enabled[qe_index] = enabled;
		qe_total_count[qe_index] = 0;
		switch (qe_index) {
		case 0:  qe0_last_count = 0; break;
		case 1:  qe1_last_count = 0; break;
		case 2:  qe2_last_count = 0; break;
		case 3:  qe3_last_count = 0; break;
		case 4:  qe4_last_count = 0; break;
		default: break;
		}
        NVIC_EnableIRQ(SysTick_IRQn);
	}
}

void HAL_IOCX_SysTick_Handler()
{
	/* NOTE:  Timers 1, 3, 4 are 16-bit; Timers 2, 5 are 32-bit. */
	if (qe_enabled[0]) {
		uint16_t qe0_curr_count = (uint16_t)TIM1->CNT;
		qe_total_count[0] += (int16_t)(qe0_curr_count - qe0_last_count);
		qe0_last_count = qe0_curr_count;
	}
	if (qe_enabled[1]) {
		uint32_t qe1_curr_count = (uint32_t)TIM2->CNT;
		qe_total_count[1] += (int32_t)(qe1_curr_count - qe1_last_count);
		qe1_last_count = qe1_curr_count;
	}
	if (qe_enabled[2]) {
		uint16_t qe2_curr_count = (uint16_t)TIM3->CNT;
		qe_total_count[2] += (int16_t)(qe2_curr_count - qe2_last_count);
		qe2_last_count = qe2_curr_count;
	}
	if (qe_enabled[3]) {
		uint16_t qe3_curr_count = (uint16_t)TIM4->CNT;
		qe_total_count[3] += (int16_t)(qe3_curr_count - qe3_last_count);
		qe3_last_count = qe3_curr_count;
	}
	if (qe_enabled[4]) {
		uint32_t qe4_curr_count = (uint32_t)TIM5->CNT;
		qe_total_count[4] += (int32_t)(qe4_curr_count - qe4_last_count);
		qe4_last_count = qe4_curr_count;
	}
}

