kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
typedef struct {
	TIM_HandleTypeDef *p_tim_handle;
	uint32_t core_clock_divider;
	uint32_t first_channel_number;
	uint32_t second_channel_number;
	uint32_t max_auto_reload_value;
	int cc_irqn;
} Timer_Config;

static Timer_Config timer_configs[IOCX_NUM_TIMERS] =
{
	{&htim1, TIM_CLOCKDIVISION_DIV1, TIM_CHANNEL_1, TIM_CHANNEL_2, 0xFFFF, TIM1_CC_IRQn},
	{&htim2, TIM_CLOCKDIVISION_DIV2, TIM_CHANNEL_1, TIM_CHANNEL_2, 0xFFFFFFFF, TIM2_IRQn},
	{&htim3, TIM_CLOCKDIVISION_DIV2, TIM_CHANNEL_1, TIM_CHANNEL_2, 0xFFFF, TIM3_IRQn},
	{&htim4, TIM_CLOCKDIVISION_DIV2, TIM_CHANNEL_1, TIM_CHANNEL_2, 0xFFFF, TIM4_IRQn},
	{&htim5, TIM_CLOCKDIVISION_DIV2, TIM_CHANNEL_1, TIM_CHANNEL_2, 0xFFFFFFFF, TIM5_IRQn},
	{&htim9, TIM_CLOCKDIVISION_DIV1, TIM_CHANNEL_1, TIM_CHANNEL_2, 0xFFFF, TIM1_BRK_TIM9_IRQn},
};

uint8_t curr_timer_cfg[IOCX_NUM_TIMERS]; /* All defaults have 0 value (disabled) */

uint16_t timer_channel_ccr[IOCX_NUM_TIMERS][IOCX_NUM_CHANNELS_PER_TIMER];

uint32_t timer_last_capture_interrupt_timestamp_ms[IOCX_NUM_TIMERS];
uint32_t timer_last_capture_max_timestamp_delta_ms[IOCX_NUM_TIMERS];

void HAL_IOCX_GPIO_Set_Config(uint8_t gpio_index, uint8_t config) {

	if ( gpio_index > (IOCX_NUM_GPIOS-1) ) return;

	/* Before configuring, deinit; this clears the GPIO to default state */
	HAL_GPIO_DeInit(gpio_channels[gpio_index].p_gpio, gpio_channels[gpio_index].pin);
	IOCX_gpio_pin_mode_configuration[POSITION_VAL(gpio_channels[gpio_index].pin)] = 0;
	if (gpio_channels[gpio_index].interrupt_type == INT_ALTPIN ) {
		/* Deinit the altpin gpio */
		HAL_GPIO_DeInit(p_altint_port, altint_pin);
		IOCX_gpio_pin_mode_configuration[POSITION_VAL(altint_pin)] = 0;
	}

	IOCX_GPIO_TYPE type = iocx_decode_gpio_type(&config);
	IOCX_GPIO_INPUT input = iocx_decode_gpio_input(&config);
	IOCX_GPIO_INTERRUPT interrupt_mode = iocx_decode_gpio_interrupt(&config);

	GPIO_InitTypeDef GPIO_InitStruct;
	GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
	GPIO_InitStruct.Pin = gpio_channels[gpio_index].pin;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_NOPULL;

	GPIO_InitTypeDef GPIO_InitStructAltpin;
	int altpin_int_enabled = 0;

	switch(type){
	case GPIO_TYPE_INPUT:
		GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
		/* Enable the Pin as Input */
		switch(input){
		default:
		case GPIO_INPUT_FLOAT:
			GPIO_InitStruct.Pull = GPIO_NOPULL;
			break;
		case GPIO_INPUT_PULLUP:
			GPIO_InitStruct.Pull = GPIO_PULLUP;
			break;
		case GPIO_INPUT_PULLDOWN:
			GPIO_InitStruct.Pull = GPIO_PULLDOWN;
			break;
		}
		if((gpio_channels[gpio_index].interrupt_type == INT_EXTI) ||
		   (gpio_channels[gpio_index].interrupt_type == INT_ALTPIN)) {
			switch(interrupt_mode) {
			case GPIO_INTERRUPT_RISING_EDGE:
				GPIO_InitStruct.Mode |= GPIO_MODE_IT_RISING;
				break;
			case GPIO_INTERRUPT_FALLING_EDGE:
				GPIO_InitStruct.Mode |= GPIO_MODE_IT_FALLING;
				break;
			case GPIO_INTERRUPT_BOTH_EDGES:
				GPIO_InitStruct.Mode |= GPIO_MODE_IT_RISING_FALLING;
				break;
			case GPIO_INTERRUPT_DISABLED:
				break;
			}
		}
		if (gpio_channels[gpio_index].interrupt_type == INT_ALTPIN) {
			GPIO_InitStructAltpin.Speed = GPIO_InitStruct.Speed;
			GPIO_InitStructAltpin.Pin = altint_pin;
			GPIO_InitStructAltpin.Mode = GPIO_InitStruct.Mode;
			GPIO_InitStructAltpin.Pull = GPIO_InitStruct.Pull;
			altpin_int_enabled = 1;
		}
		break;
	case GPIO_TYPE_OUTPUT_PUSHPULL:
		GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
		break;
	case GPIO_TYPE_OUTPUT_OPENDRAIN:
		GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
		break;
	case GPIO_TYPE_AF:
		if ( gpio_channels[gpio_index].alt_function <= MAX_VALID_STM32_AF_VALUE ) {
			GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
			GPIO_InitStruct.Alternate = gpio_channels[gpio_index].alt_function;
		} else {
			GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
			GPIO_InitStruct.Pull = GPIO_PULLDOWN; // ???
			// TODO:  Enable Interrupt if alt_function == GPIO_AF_SW_RESET_COUNTER
			// TODO:  Enable Software function
		}
		/* TODO:  If the timer is running, stop it? */
		/* TODO:  If the timer was stopped above, restart it? */
		break;
	case GPIO_TYPE_DISABLED:
	default:
		// TODO:  If a software alternate function, disable that function
		return;
	}
	if (!altpin_int_enabled) {
		HAL_GPIO_Init(gpio_channels[gpio_index].p_gpio, &GPIO_InitStruct);
		IOCX_gpio_pin_mode_configuration[POSITION_VAL(gpio_channels[gpio_index].pin)] = GPIO_InitStruct.Mode;
	} else {
		HAL_GPIO_Init(p_altint_port, &GPIO_InitStructAltpin);
		IOCX_gpio_pin_mode_configuration[POSITION_VAL(altint_pin)] = GPIO_InitStructAltpin.Mode;
	}
}

void HAL_IOCX_GPIO_Get(uint8_t first_gpio_index, int count, uint8_t *values)
{
	int i;
	if ( first_gpio_index > (IOCX_NUM_GPIOS-1) ) return;
	if ( first_gpio_index + count > IOCX_NUM_GPIOS) {
		count = IOCX_NUM_GPIOS - first_gpio_index;
	}
	for ( i = first_gpio_index; i < first_gpio_index + count; i++ ) {
		*values++ = (HAL_GPIO_ReadPin(gpio_channels[i].p_gpio, gpio_channels[i].pin) == GPIO_PIN_SET) ?
			IOCX_GPIO_SET : IOCX_GPIO_RESET;
	}
}

void HAL_IOCX_GPIO_Set(uint8_t gpio_index, uint8_t value)
{
	if ( gpio_index > (IOCX_NUM_GPIOS-1) ) return;
    HAL_GPIO_WritePin( gpio_channels[gpio_index].p_gpio, gpio_channels[gpio_index].pin,
    		(value != IOCX_GPIO_RESET) ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

void HAL_IOCX_TIMER_Enable_Clocks(uint8_t timer_index, int enable)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;

	switch(timer_index){
	case 0: enable ? __TIM1_CLK_ENABLE() : __TIM1_CLK_DISABLE(); break;
	case 1: enable ? __TIM2_CLK_ENABLE() : __TIM2_CLK_DISABLE(); break;
	case 2: enable ? __TIM3_CLK_ENABLE() : __TIM3_CLK_DISABLE(); break;
	case 3: enable ? __TIM4_CLK_ENABLE() : __TIM4_CLK_DISABLE(); break;
	case 4: enable ? __TIM5_CLK_ENABLE() : __TIM5_CLK_DISABLE(); break;
	case 5: enable ? __TIM9_CLK_ENABLE() : __TIM9_CLK_DISABLE(); break;
	}
}

#define BOTH_ENCODER_TIMER_CHANNELS 0xFF /*(TIM_CHANNEL_1 and TIM_CHANNEL_2)*/

/* Timer Capture Complete Interrupt Service Routine Callback */
void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *p_htim) {
	int i;
	for ( i = 0; i < IOCX_NUM_TIMERS; i++ ) {
		if (p_htim == timer_configs[i].p_tim_handle) {
			timer_last_capture_interrupt_timestamp_ms[i] = HAL_GetTick();
			break;
		}
	}
}

