kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
void HAL_IOCX_TIMER_ConfigureInterruptPriorities(uint8_t timer_index) {
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	int cc_irqn = timer_configs[timer_index].cc_irqn;
    HAL_NVIC_SetPriority(cc_irqn, 7, 0);
}

void HAL_IOCX_TIMER_Enable_Capture_Interrupt(uint8_t timer_index, int enable) {
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	int cc_irqn = timer_configs[timer_index].cc_irqn;
	if (enable) {
		HAL_NVIC_EnableIRQ(cc_irqn);
	} else {
		HAL_NVIC_DisableIRQ(cc_irqn);
	}
}

void HAL_IOCX_TIMER_Set_Config(uint8_t timer_index, uint8_t config)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;

	IOCX_TIMER_MODE mode = iocx_decode_timer_mode(&config);
	IOCX_QUAD_ENCODER_MODE qe_mode = iocx_decode_quad_encoder_mode(&config);
	IOCX_INPUT_CAPTURE_CHANNEL inputcap_channel = iocx_decode_input_capture_channel(&config);
	//IOCX_INPUT_CAPTURE_POLARITY inputcap_polarity = iocx_decode_input_capture_polarity(&config);
	IOCX_PWM_CAPTURE_TIMEOUT pwm_cap_timeout = iocx_decode_pwm_capture_timeout(&config);

	if (mode != TIMER_MODE_QUAD_ENCODER) {
		ResetQEIntegrator(timer_index, 0 /* Disable */ );
	}

	switch(mode){
	case TIMER_MODE_DISABLED:
		HAL_IOCX_TIMER_Enable_Capture_Interrupt(timer_index,0);
		__HAL_TIM_DISABLE(timer_configs[timer_index].p_tim_handle);
		switch (iocx_decode_timer_mode(&curr_timer_cfg[timer_index])) {
		case TIMER_MODE_QUAD_ENCODER:
			HAL_TIM_Encoder_Stop(timer_configs[timer_index].p_tim_handle, BOTH_ENCODER_TIMER_CHANNELS);
			break;
		case TIMER_MODE_PWM_OUT:
			HAL_TIM_PWM_Stop(timer_configs[timer_index].p_tim_handle, timer_configs[timer_index].first_channel_number);
			HAL_TIM_PWM_Stop(timer_configs[timer_index].p_tim_handle, timer_configs[timer_index].second_channel_number);
			break;
		case TIMER_MODE_PWM_CAPTURE:
		{
			HAL_TIM_IC_Stop_IT(timer_configs[timer_index].p_tim_handle, timer_configs[timer_index].first_channel_number);
			HAL_TIM_IC_Stop(timer_configs[timer_index].p_tim_handle, timer_configs[timer_index].second_channel_number);
			break;
		}
		default:
			break;
		}
		break;

	case TIMER_MODE_QUAD_ENCODER:
		{
			TIM_Encoder_InitTypeDef sConfig;
			TIM_MasterConfigTypeDef sMasterConfig;

			TIM_HandleTypeDef * p_htim = timer_configs[timer_index].p_tim_handle;
			p_htim->Init.ClockDivision = timer_configs[timer_index].core_clock_divider;
			p_htim->Init.Prescaler = p_htim->Instance->PSC;
			p_htim->Init.CounterMode = TIM_COUNTERMODE_UP;
			p_htim->Instance->ARR = timer_configs[timer_index].max_auto_reload_value;
			p_htim->Init.Period = p_htim->Instance->ARR;
			if (qe_mode == QUAD_ENCODER_MODE_4x) {
				// A & B signal, both edges
				sConfig.EncoderMode = TIM_ENCODERMODE_TI12;
			} else /* 1x or 2x */ {
				// A signal only.  Both edges are counted,
				// and if 1x the count is divided by two (later)
				sConfig.EncoderMode = TIM_ENCODERMODE_TI1;
			}
			qe_curr_mode[timer_index] = qe_mode;
			sConfig.IC1Prescaler = TIM_ICPSC_DIV1;
			sConfig.IC2Prescaler = TIM_ICPSC_DIV1;
			sConfig.IC1Polarity  = TIM_ICPOLARITY_RISING;
			sConfig.IC2Polarity  = TIM_ICPOLARITY_RISING;
			sConfig.IC1Selection = TIM_ICSELECTION_DIRECTTI;
			sConfig.IC2Selection = TIM_ICSELECTION_DIRECTTI;
			sConfig.IC1Filter    = 0x05;
			sConfig.IC2Filter    = 0x05;
			HAL_TIM_Encoder_Init(p_htim, &sConfig);

			sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
			sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
			HAL_TIMEx_MasterConfigSynchronization(p_htim, &sMasterConfig);

			/* Be sure to configure the auto-reload register (ARR) to the max possible value. */
			p_htim->Instance->ARR = timer_configs[timer_index].max_auto_reload_value;

			ResetQEIntegrator(timer_index, 1 /* Enable */);

			HAL_TIM_Encoder_Start(p_htim, BOTH_ENCODER_TIMER_CHANNELS);
		}
		break;

	case TIMER_MODE_PWM_OUT:
		{
			TIM_OC_InitTypeDef sConfigOC;
			TIM_HandleTypeDef * p_htim = timer_configs[timer_index].p_tim_handle;

			// Prescaler and Period must be already set before enabling.
			p_htim->Init.CounterMode = TIM_COUNTERMODE_UP;
			p_htim->Init.ClockDivision = timer_configs[timer_index].core_clock_divider;
			HAL_TIM_PWM_Init(p_htim);

			// Periods (CCR) for both channels must be already set before enabling.
			sConfigOC.OCMode = TIM_OCMODE_PWM1;
			sConfigOC.Pulse = timer_channel_ccr[timer_index][0];
			sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
			sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
			HAL_TIM_PWM_ConfigChannel(p_htim, &sConfigOC, timer_configs[timer_index].first_channel_number);
			sConfigOC.Pulse = timer_channel_ccr[timer_index][1];
			HAL_TIM_PWM_ConfigChannel(p_htim, &sConfigOC, timer_configs[timer_index].second_channel_number);

			HAL_TIM_PWM_Start(p_htim, timer_configs[timer_index].first_channel_number);
			HAL_TIM_PWM_Start(p_htim, timer_configs[timer_index].second_channel_number);
		}
		break;

	case TIMER_MODE_PWM_CAPTURE:
		{
			uint32_t input_trigger;
			TIM_ClockConfigTypeDef sClockSourceConfig;
			TIM_SlaveConfigTypeDef sSlaveConfig;
			TIM_IC_InitTypeDef sConfigIC;
			TIM_MasterConfigTypeDef sMasterConfig;

			uint16_t normalized_prescaler;
			HAL_IOCX_TIMER_Get_Normalized_Prescaler(timer_index, normalized_prescaler);
			uint32_t max_capture_period_ms =
					1 * (65535 / (48000/normalized_prescaler));
			switch(pwm_cap_timeout) {
			case PWM_CAPTURE_TIMEOUT_NONE:
				timer_last_capture_max_timestamp_delta_ms[timer_index] = 0;
				break;
			case PWM_CAPTURE_TIMEOUT_1X:
				timer_last_capture_max_timestamp_delta_ms[timer_index] =
						1 * max_capture_period_ms;
				break;
			case PWM_CAPTURE_TIMEOUT_2X:
				timer_last_capture_max_timestamp_delta_ms[timer_index] =
						2 * max_capture_period_ms;
				break;
			case PWM_CAPTURE_TIMEOUT_3X:
				timer_last_capture_max_timestamp_delta_ms[timer_index] =
						3 * max_capture_period_ms;
				break;
			}

			TIM_HandleTypeDef * p_htim = timer_configs[timer_index].p_tim_handle;

			// Prescaler must be already set before enabling.
			p_htim->Init.CounterMode = TIM_COUNTERMODE_UP;
			p_htim->Init.Period = timer_configs[timer_index].max_auto_reload_value;
			p_htim->Init.ClockDivision = timer_configs[timer_index].core_clock_divider;
			p_htim->Init.RepetitionCounter = 0;

			HAL_TIM_IC_Init(p_htim);

			sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
			HAL_TIM_ConfigClockSource(p_htim, &sClockSourceConfig);

			if (inputcap_channel == INPUT_CAPTURE_FROM_CH1) {
				input_trigger = TIM_TS_TI1FP1;
			} else {
				input_trigger = TIM_TS_TI2FP2;
			}

