kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
			sSlaveConfig.SlaveMode = TIM_SLAVEMODE_RESET;
			sSlaveConfig.InputTrigger = input_trigger;
			sSlaveConfig.TriggerPolarity = TIM_INPUTCHANNELPOLARITY_RISING;
			sSlaveConfig.TriggerPrescaler = TIM_ICPSC_DIV1;
			sSlaveConfig.TriggerFilter = 0;
			HAL_TIM_SlaveConfigSynchronization(p_htim, &sSlaveConfig);

			sConfigIC.ICPolarity = TIM_INPUTCHANNELPOLARITY_RISING;
			sConfigIC.ICSelection =
					(inputcap_channel == INPUT_CAPTURE_FROM_CH1) ?
						TIM_ICSELECTION_DIRECTTI :
						TIM_ICSELECTION_INDIRECTTI;
			sConfigIC.ICPrescaler = TIM_ICPSC_DIV1;
			sConfigIC.ICFilter = 0x05;
			HAL_TIM_IC_ConfigChannel(p_htim, &sConfigIC, TIM_CHANNEL_1);

			sConfigIC.ICPolarity = TIM_INPUTCHANNELPOLARITY_FALLING;
			sConfigIC.ICSelection =
					(inputcap_channel == INPUT_CAPTURE_FROM_CH1) ?
						TIM_ICSELECTION_INDIRECTTI :
						TIM_ICSELECTION_DIRECTTI;
			HAL_TIM_IC_ConfigChannel(p_htim, &sConfigIC, TIM_CHANNEL_2);

			sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
			sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
			HAL_TIMEx_MasterConfigSynchronization(p_htim, &sMasterConfig);

			/* Start channels; first channel should generate capture interrupts */
			HAL_TIM_IC_Start_IT(p_htim, timer_configs[timer_index].first_channel_number);
			HAL_TIM_IC_Start(p_htim, timer_configs[timer_index].second_channel_number);

			HAL_IOCX_TIMER_Enable_Capture_Interrupt(timer_index,1);
		}
		break;

	default:
		return;
	}
	curr_timer_cfg[timer_index] = config;
}

void HAL_IOCX_TIMER_Set_Control(uint8_t timer_index, uint8_t* control)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	IOCX_TIMER_COUNTER_RESET reset = iocx_decode_timer_counter_reset(control);
	if (reset == RESET_REQUEST) {
		/* Generate a Timer Update event - which clears the counter (and prescaler counter) */
		HAL_TIM_GenerateEvent(timer_configs[timer_index].p_tim_handle, TIM_EventSource_Update);
		iocx_clear_timer_counter_reset(control);
		if (QEIntegratorEnabled(timer_index)) {
			ResetQEIntegrator(timer_index, 1 /* Enable */ );
		}
	}
}

void HAL_IOCX_TIMER_Set_Prescaler(uint8_t timer_index, uint16_t ticks_per_clock)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	/* If one of the 96Mhz timers, multiply ticks/clock by 2 to mimic 48Mhz timers */
	if (timer_configs[timer_index].core_clock_divider == TIM_CLOCKDIVISION_DIV1) {
		ticks_per_clock *= 2;
	}
	timer_configs[timer_index].p_tim_handle->Init.Prescaler = (uint32_t)ticks_per_clock;
}

void HAL_IOCX_TIMER_Get_Prescaler(uint8_t first_timer_index, int count, uint16_t *values)
{
	uint8_t i;
	if ( first_timer_index > (IOCX_NUM_TIMERS-1) ) return;
	if ( first_timer_index + count > IOCX_NUM_TIMERS) {
		count = IOCX_NUM_TIMERS - first_timer_index;
	}

	for ( i = first_timer_index; i < first_timer_index + count; i++ ) {
		*values++ = (uint16_t)timer_configs[i].p_tim_handle->Init.Prescaler;
	}
}

/* Gets prescaler value in microseconds */
void HAL_IOCX_TIMER_Get_Normalized_Prescaler(uint8_t timer_index, uint16_t *prescaler_normalized)
{
	uint8_t i;
	*prescaler_normalized = 0;
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;

	uint16_t raw_prescaler_value = (uint16_t)timer_configs[timer_index].p_tim_handle->Init.Prescaler;
	/* Normalize prescaler value to be based on 48Mhz clock */
	if (timer_configs[timer_index].core_clock_divider == TIM_CLOCKDIVISION_DIV1) {
		raw_prescaler_value /= 2;
	}
	prescaler_normalized = raw_prescaler_value;
}


void HAL_IOCX_TIMER_Get_Count(uint8_t first_timer_index, int count, int32_t *values)
{
	uint8_t i;
	if ( first_timer_index > (IOCX_NUM_TIMERS-1) ) return;
	if ( first_timer_index + count > IOCX_NUM_TIMERS) {
		count = IOCX_NUM_TIMERS - first_timer_index;
	}
	for ( i = first_timer_index; i < first_timer_index + count; i++ ) {
		if (QEIntegratorEnabled(i)) {
			if (qe_curr_mode[i] == QUAD_ENCODER_MODE_1x) {
				*values++ = qe_total_count[i] >> 1; /* Divide by 2 */
			} else {
				*values++ = qe_total_count[i];
			}
		} else {
			*values++ = (int32_t)timer_configs[i].p_tim_handle->Instance->CNT;
		}
	}
}

void HAL_IOCX_TIMER_Get_Direction(uint8_t first_timer_index, int count, uint8_t *values)
{
	uint8_t i;
	if ( first_timer_index > (IOCX_NUM_TIMERS-1) ) return;
	if ( first_timer_index + count > IOCX_NUM_TIMERS) {
		count = IOCX_NUM_TIMERS - first_timer_index;
	}
	for ( i = first_timer_index; i < first_timer_index + count; i++ ) {
		uint32_t cr1_reg = timer_configs[i].p_tim_handle->Instance->CR1;
		*values++ = ((cr1_reg & 0x00000010) ? 1 : 0);
	}
}

void HAL_IOCX_TIMER_PWM_Set_FramePeriod(uint8_t timer_index, uint16_t clocks_per_frame_period)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	timer_configs[timer_index].p_tim_handle->Init.Period = clocks_per_frame_period;
}

void HAL_IOCX_TIMER_PWM_Get_FramePeriod(uint8_t first_timer_index, int count, uint16_t* values)
{
	uint8_t i;
	if ( first_timer_index > (IOCX_NUM_TIMERS-1) ) return;
	if ( first_timer_index + count > IOCX_NUM_TIMERS) {
		count = IOCX_NUM_TIMERS - first_timer_index;
	}
	for ( i = first_timer_index; i < first_timer_index + count; i++ ) {
		*values++ = (uint16_t)timer_configs[i].p_tim_handle->Init.Period;
	}
}

void HAL_IOCX_TIMER_PWM_Set_DutyCycle(uint8_t timer_index, uint8_t channel_index, uint16_t clocks_per_active_period)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	timer_channel_ccr[timer_index][channel_index] = clocks_per_active_period;
	if (iocx_decode_timer_mode(&curr_timer_cfg[timer_index]) != TIMER_MODE_DISABLED) {
		/* Stop Existing timer; restart to cause new Duty Cycle to take effect. */
		uint8_t prev_timer_mode = curr_timer_cfg[timer_index];
		uint8_t disabled_timer_mode;
		iocx_encode_timer_mode(&disabled_timer_mode, TIMER_MODE_DISABLED);
		HAL_IOCX_TIMER_Set_Config(timer_index, disabled_timer_mode);
		HAL_IOCX_TIMER_Set_Config(timer_index, prev_timer_mode);
	}
}

#define MAX_PWM_CAP_TIMESTAMP_DELTA_MS 100

void HAL_IOCX_TIMER_PWM_Get_DutyCycle(uint8_t first_timer_index, uint8_t first_channel_index, int channel_count, uint16_t *values)
{
	if ( first_timer_index > (IOCX_NUM_TIMERS-1) ) return;
	if ( first_channel_index > (IOCX_NUM_CHANNELS_PER_TIMER-1) ) return;
	size_t curr_struct_index = (first_timer_index * IOCX_NUM_CHANNELS_PER_TIMER) + first_channel_index;
	size_t num_entries = (sizeof(timer_channel_ccr) / sizeof(timer_channel_ccr[0][0]));
	if ( channel_count > (num_entries - curr_struct_index) ) {
		channel_count = num_entries - curr_struct_index;
	}
	int iTimer;
	int iChannel;
	int iValueIndex = 0;
	int iChannelCount = 0;
	for ( iTimer = 0; iTimer < IOCX_NUM_TIMERS; iTimer++ ) {
		uint8_t timer_cfg = curr_timer_cfg[iTimer];
		IOCX_TIMER_MODE mode = iocx_decode_timer_mode(&timer_cfg);
		IOCX_INPUT_CAPTURE_CHANNEL inputcap_channel = iocx_decode_input_capture_channel(&timer_cfg);
		uint32_t last_capture_timestamp = timer_last_capture_interrupt_timestamp_ms[iTimer];
		uint32_t curr_timestamp = HAL_GetTick();
		uint32_t ts_delta = curr_timestamp - last_capture_timestamp;
		for ( iChannel = 0; iChannel < IOCX_NUM_CHANNELS_PER_TIMER; iChannel++ ) {
			if (((iTimer == first_timer_index) && (iChannel >= first_channel_index)) ||
			    (iTimer > first_timer_index)) {
				TIM_HandleTypeDef * p_htim = timer_configs[iTimer].p_tim_handle;
				if (iChannel == 0) {
					if (mode == TIMER_MODE_PWM_CAPTURE) {
						if (ts_delta < MAX_PWM_CAP_TIMESTAMP_DELTA_MS) {
							if (inputcap_channel == INPUT_CAPTURE_FROM_CH1) {
								values[iValueIndex] = (uint16_t)p_htim->Instance->CCR1;
							} else {
								values[iValueIndex] = (uint16_t)p_htim->Instance->CCR2;
							}
						} else {
							values[iValueIndex] = 0; // No recent data received
						}
					} else {
						values[iValueIndex] = (uint16_t)p_htim->Instance->CCR1;
					}
				} else if (iChannel == 1) {
					if (mode == TIMER_MODE_PWM_CAPTURE) {
						if (ts_delta < MAX_PWM_CAP_TIMESTAMP_DELTA_MS) {
							if (inputcap_channel == INPUT_CAPTURE_FROM_CH1) {
								values[iValueIndex] = (uint16_t)p_htim->Instance->CCR2;
							} else {
								values[iValueIndex] = (uint16_t)p_htim->Instance->CCR1;
							}
						} else {
							values[iValueIndex] = 0; // No recent data received
						}
					} else {
						values[iValueIndex] = (uint16_t)p_htim->Instance->CCR2;
					}
				}
				iValueIndex++;
				iChannelCount++;
			}
			if (iChannelCount >= channel_count) {
				break;
			}
		}
	}
}
#endif

/* PWM Mode signals are generated with a frequency determined by the value  */
/* of the TIMx_ARR register and a duty cycle determined by the value of the */
/* TIMx_CCRx register                                                       */


/***************************************************************************/
/* ADC section                                                             */
/*                                                                         */
/* A single ADC with multiple channels is used.  The ADC is clocked by     */
/* PCLK2, which is configured for 96Mhz, and an internal divide-by-8       */
/* configuration yields an ADC clock rate (fADC) of 12Mhz.                 */
/*                                                                         */
/* The STM32 is a Successive-Approximation ADC, configured for 12-bit      */
/* resolution.  Each sample requires 1 clock for each bit of resolution    */
/* +3 ADC Clocks - plus a sample period.  Longer sample periods provide    */
/* more time for the input capacitor to charge and stabilize before        */
/* sampling begins.  Tests have shown longer sample periods reduce the     */
/* impact of noise, and the currently-selected sample period is 28 clocks. */
/* This yields an overall sample rate of 150Ksps, as follows:              */
/*                                                                         */
/* ADCCLK = 96Mhz / 8 = 12 Mhz                                             */
/* NumChannels = 6                                                         */
/* SamplePeriodClks = 28                                                   */
/* ResolutionClks = 15                                                     */
/* sample_rate = ADCCLK/(NumChannels * (SamplePeriodClks + ResolutionClks) */
/* sample_rate = 46.5ksps                                                  */
/***************************************************************************/
/* Input Channel Mapping:                                                  */
/* An Connector 1:  ADC1_IN9                                               */
/* An Connector 2:  ADC1_IN8                                               */
/* An Connector 3:  ADC1_IN15                                              */
/* An Connector 4:  ADC1_IN14                                              */
/* Analog Input 5V/3.3V Jumper:  ADC1_IN10                                 */
/* Ext 12VDC Battery Input:  ADC1_IN11                                     */
/***************************************************************************/
/* ADC1 is configured in scan conversion mode, scanning each channel in    */
/* order of connector number.                                              */
/* DMA Transfer of data to SRAM is used.  The DMA transfer is configured   */
/* in circular mode.  In this way, ADC data is continually transferred     */
/* into the buffer, and software can read out data from the buffer while   */
/* transfers are in progress.                                              */
/***************************************************************************/

#ifdef ENABLE_ADC
#define ADC_CLOCK_FREQUENCY 12000000
#define ADC_CLOCKS_PER_SAMPLE 43
#define ADC_NUM_CHANNELS 6
#define ADC_NUM_EXTERNAL_CHANNELS 4
#define ADC_CHANNEL_ANALOG_VOLTAGE_SWITCH 4
#define ADC_CHANNEL_EXT_POWER_VOLTAGE_DIV 5
#define INVALID_ADC_CHANNEL_NUMBER 6
/* NOTE:  The last two ADC channels are reserved for internal use; the preceding  */
/* ADC channels are user GPIOs.                                                   */
/* The next-to-last channel is the 5V vs 3.3V Analog Input Voltage measure        */
/*   (if this value is > 2.5V, then the Analog Voltage Input High Level is 5V)    */
/* The last channel measures the 12VDC input voltage (w/a voltage divider 4.45:1, */
/*   to ensure that the max voltage does not exceed 3.3V).                        */

