kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
typedef struct {
	uint16_t data[ADC_NUM_CHANNELS];
} ADC_Samples;

uint32_t adc_channels[ADC_NUM_CHANNELS] = {
		ADC_CHANNEL_9,  // Ext Analog Input 1
		ADC_CHANNEL_8,  // Ext Analog Input 2
		ADC_CHANNEL_15, // Ext Analog Input 3
		ADC_CHANNEL_14, // Ext Analog Input 4
		ADC_CHANNEL_10,	// Analog Voltage Switch
		ADC_CHANNEL_11  // Ext Power Voltage
};

#define MAX_NUM_ADC_OVERSAMPLE_BITS 7
#define MAX_NUM_ADC_SAMPLES (1 << MAX_NUM_ADC_OVERSAMPLE_BITS) /* MUST be power of 2 */
ADC_Samples adc_samples[MAX_NUM_ADC_SAMPLES];
int adc_enabled = 0;
#endif

/* Note:  ADC DMA is configured for 16-bit words.  The "Length" Parameter to HAL_ADC_Start_DMA */
/* below is the number of 16-bit words transferred - NOT the number of bytes.                  */

void HAL_IOCX_ADC_Enable(int enable)
{
#ifdef ENABLE_ADC
	if (enable) {
		if (adc_enabled == 0) {
			memset(&adc_samples,0, sizeof(adc_samples));
			HAL_StatusTypeDef status = HAL_ADC_Start_DMA(&hadc1,
					(uint32_t *)&adc_samples, sizeof(adc_samples) / sizeof(uint16_t));
			adc_enabled = ( status == HAL_OK ) ? 1 : 0;
		}
	} else {
		if (adc_enabled) {
			HAL_ADC_Stop_DMA(&hadc1);
			adc_enabled = 0;
		}
	}
#endif
}

#ifdef ENABLE_ADC
static const uint32_t c_total_adc_transfers = sizeof(adc_samples) / sizeof(uint16_t);
static const uint8_t c_num_adc_transfers_per_sampleset = (sizeof(adc_samples[0]) / sizeof(uint16_t));
#endif

void HAL_IOCX_ADC_Get_Latest_Samples(int start_channel, int n_channels, uint32_t *p_oversamples, uint8_t oversample_bits, uint32_t *p_avgsamples, uint8_t avg_bits)
{
#ifdef ENABLE_ADC
	/* Range-check inputs */
	if (oversample_bits > MAX_NUM_ADC_OVERSAMPLE_BITS) {
		oversample_bits = MAX_NUM_ADC_OVERSAMPLE_BITS;
	}
	if (avg_bits > MAX_NUM_ADC_OVERSAMPLE_BITS) {
		avg_bits = MAX_NUM_ADC_OVERSAMPLE_BITS;
	}
	if (start_channel > (ADC_NUM_CHANNELS-1)) {
		return;
	}
	if ((start_channel + n_channels) > (ADC_NUM_CHANNELS-1)) {
		n_channels = ADC_NUM_CHANNELS - start_channel;
	}

	uint8_t num_samples_to_accumulate = 1 << oversample_bits;

	/* Determine which contiguous region of the ADC DMA transfer buffer     */
	/* contains the most recent N samples, where N is defined by the number */
	/* of oversample bits.                                                  */

	/* Note each transfer is a 16-bit ADC Sample (2 bytes) */
	uint32_t remaining_adc_transfers = hadc1.DMA_Handle->Instance->NDTR;
	uint32_t last_valid_adc_transfer = c_total_adc_transfers - remaining_adc_transfers;
	if (last_valid_adc_transfer == 0) {
		last_valid_adc_transfer = c_total_adc_transfers - 1;
	} else{
		last_valid_adc_transfer -= 1;
	}
	uint32_t total_adc_transfer_sets = sizeof(adc_samples) / sizeof(adc_samples[0]);

	uint16_t last_valid_adc_transfer_set = last_valid_adc_transfer / c_num_adc_transfers_per_sampleset;
	uint16_t first_valid_adc_transfer_set;
	if (num_samples_to_accumulate <= last_valid_adc_transfer_set) {
		first_valid_adc_transfer_set = last_valid_adc_transfer_set - num_samples_to_accumulate + 1;
	} else {
		/* Buffer wrap around case; accumulate from the end of the buffer. */
		last_valid_adc_transfer_set = (total_adc_transfer_sets - 1);
		first_valid_adc_transfer_set = last_valid_adc_transfer_set - num_samples_to_accumulate + 1;
	}

	/* Zero Accumulator */
	int i, j;
	for ( i = 0; i < n_channels; i++ ) {
		p_oversamples[i] = 0;
	}
	/* Accumulate */
	for ( i = first_valid_adc_transfer_set; i <= last_valid_adc_transfer_set; i++ ) {
		uint16_t *p_sample_set = &(adc_samples[i].data[start_channel]);
		for ( j = 0; j < n_channels; j++ ) {
			p_oversamples[j] += *p_sample_set++;
		}
	}
	/* Average */
	for ( i = 0; i < n_channels; i++ ) {
		p_avgsamples[i] = p_oversamples[i] >> avg_bits;
		if (p_avgsamples[i] > 5000) {
			p_avgsamples[i] = 1; // debug hook
		}
	}
#endif
}

void HAL_IOCX_ADC_Get_Samples( int start_channel, int n_channels, uint16_t* p_samples, uint8_t n_samples_to_average )
{
#ifdef ENABLE_ADC
	/* Range-check inputs */
	if ( n_samples_to_average > (sizeof(adc_samples)/sizeof(adc_samples[0]))) {
		n_samples_to_average = (sizeof(adc_samples)/sizeof(adc_samples[0]));
	}
	if (start_channel > (ADC_NUM_CHANNELS-1)) {
		return;
	}
	if ((start_channel + n_channels) > (ADC_NUM_CHANNELS-1)) {
		n_channels = ADC_NUM_CHANNELS - start_channel;
	}
	if (n_samples_to_average > MAX_NUM_ADC_SAMPLES ) {
		n_samples_to_average = MAX_NUM_ADC_SAMPLES;
	}
	/* Zero Accumulator */
	uint32_t accum[ADC_NUM_CHANNELS];
	int i, j;
	for ( i = 0; i < ADC_NUM_CHANNELS; i++ ) {
		accum[i] = 0;
	}
	/* Accumulate */
	for ( i = 0; i < n_samples_to_average; i++ ) {
		uint16_t *p_samples = &(adc_samples[i].data[start_channel]);
		for ( j = 0; j < n_channels; j++ ) {
			accum[j] += *p_samples++;
		}
	}
	/* Average */
	for ( i = 0; i < n_channels; i++ ) {
		p_samples[i] = accum[i] / n_samples_to_average;
	}
#endif
}

#define ADC_VOLTAGE_OVERSAMPLE_BITS 3
#define ADC_VOLTAGE_AVERAGE_BITS ADC_VOLTAGE_OVERSAMPLE_BITS
/* Returns 0 if 3.3V, non-zero of 5V VDA */
int HAL_IOCX_ADC_Voltage_5V( int n_samples_to_average )
{
#ifdef ENABLE_ADC
	if ( adc_enabled ) {
		uint32_t oversample;
		uint32_t average;
		HAL_IOCX_ADC_Get_Latest_Samples(ADC_CHANNEL_ANALOG_VOLTAGE_SWITCH, 1, &oversample, ADC_VOLTAGE_OVERSAMPLE_BITS,
				&average, ADC_VOLTAGE_AVERAGE_BITS);
		return (average > 3500) ? 1 : 0;
	} else {
		return 0;
	}
#else
    return 0;
#endif
}

#define ADC_EXT_POWER_OVERSAMPLE_BITS 3
#define ADC_EXT_POWER_AVERAGE_BITS ADC_EXT_POWER_OVERSAMPLE_BITS
const float vdiv_ratio = 3.24f / (11.5f + 3.24f);

uint16_t HAL_IOCX_Get_ExtPower_Voltage()
{
#ifdef ENABLE_ADC
	if ( adc_enabled ) {
		uint32_t oversample;
		uint32_t average;
		HAL_IOCX_ADC_Get_Latest_Samples(ADC_CHANNEL_EXT_POWER_VOLTAGE_DIV, 1, &oversample,
				ADC_EXT_POWER_OVERSAMPLE_BITS, &average, ADC_EXT_POWER_AVERAGE_BITS);
		return average;
	} else {
		return 0;
	}
#else
    return 0;
#endif
}

#ifdef ENABLE_ADC
static int awdg_enabled = 0;
uint8_t awdg_channel = INVALID_ADC_CHANNEL_NUMBER;
uint16_t awdg_low_threshold = 0;
uint16_t awdg_high_threshold = 0;
int awdg_interrupt_enabled = 0;
#endif

void HAL_IOCX_ADC_AWDG_Disable()
{
#ifdef ENABLE_ADC
	ADC_AnalogWDGConfTypeDef AnalogWDGConfig;

	/**Configure the analog watchdog
	*/
	AnalogWDGConfig.WatchdogMode = ADC_ANALOGWATCHDOG_NONE;
	if(HAL_ADC_AnalogWDGConfig(&hadc1, &AnalogWDGConfig) == HAL_OK) {
		awdg_enabled = 0;
		awdg_channel = INVALID_ADC_CHANNEL_NUMBER;
	}

#endif
}

